rest_services/TEST/SOAP_SII_RutPropiedadesComuna_input.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:def="http://DefaultNamespace">
   <soapenv:Header/>
   <soapenv:Body>
      <def:getRutPropListComuna soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <strXml xsi:type="xsd:string"><![CDATA[<?xml version="1.0" encoding="UTF8" ?><sobre xmlns="http://valida.aem.gob.cl" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:xsi="http://www.w3.org/2001/XMLSchemainstance"><encabezado><idSobre>ELPISEE.inputParameter.headerParameters['id_sobre']</idSobre><fechaHora>ELPISEE.inputParameter.headerParameters['fecha_hora']</fechaHora><proveedor><nombre>ELPISEE.inputParameter.headerParameters['nombre_proveedor']</nombre><servicios><servicio>ELPISEE.inputParameter.headerParameters['nombre_servicio']</servicio><respuestaServicio><estado>SI</estado><glosa /></respuestaServicio></servicios></proveedor><consumidor><nombre>ELPISEE.inputParameter.headerParameters['nombre_consumidor']</nombre><tramite>ELPISEE.inputParameter.headerParameters['nombre_tramite']</tramite><certificado><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName /><ds:X509SerialNumber /></ds:X509IssuerSerial><ds:X509SKI /><ds:X509SubjectName /><ds:X509Certificate /><ds:X509CRL /></ds:X509Data></certificado></consumidor><fechaHoraReq>ELPISEE.inputParameter.headerParameters['fecha_hora_req']</fechaHoraReq><metadataOperacional><estadoSobre>00</estadoSobre><glosaSobre>OK</glosaSobre></metadataOperacional></encabezado><cuerpo><documento idDocumento="5475522"><rutPropiedadComuna><rut>ELPISEE.inputParameter.bodyParameters['rut']</rut><dv>ELPISEE.inputParameter.bodyParameters['dv']</dv><token>ELPISEE.inputParameter.bodyParameters['sii_token']</token></rutPropiedadComuna></documento></cuerpo></sobre>]]></strXml>
      </def:getRutPropListComuna>
   </soapenv:Body>
</soapenv:Envelope>